@rawmind0 I just tried today with same config and it did not work. Here is the output of `TF_LOG=DEBUG terraform apply`:
```
2019-07-05T11:12:45.880+0200 [DEBUG] plugin: plugin exited
2019/07/05 11:12:45 [WARN] Provider "rancher2" produced an invalid plan for module.cattle-eks.rancher2_cluster.rancher-custom, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .cluster_auth_endpoint: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalCheckPlannedChange
2019/07/05 11:12:45 [TRACE] EvalCheckPlannedChange: Verifying that actual change (action Create) matches planned change (action Create)
module.cattle-eks.rancher2_cluster.rancher-custom: Creating...
2019/07/05 11:12:45 [DEBUG] module.cattle-eks.rancher2_cluster.rancher-custom: applying the planned Create change
2019/07/05 11:12:45 [TRACE] GRPCProvider: ApplyResourceChange
2019-07-05T11:12:45.915+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 2019/07/05 11:12:45 [DEBUG] setting computed for "labels" from ComputedKeys
2019-07-05T11:12:45.915+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 2019/07/05 11:12:45 [DEBUG] setting computed for "cluster_registration_token" from ComputedKeys
2019-07-05T11:12:45.915+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 2019/07/05 11:12:45 [DEBUG] setting computed for "cluster_auth_endpoint" from ComputedKeys
2019-07-05T11:12:45.915+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 2019/07/05 11:12:45 [DEBUG] setting computed for "annotations" from ComputedKeys
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4:
Error: rpc error: code = Unavailable desc = transport is closing


panic: interface conversion: interface {} is nil, not string
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4:
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: goroutine 73 [running]:
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.toArrayString(0xc000479710, 0x1, 0x1, 0xf, 0xc0006cecb8, 0xa)
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/util.go:210 +0xfb
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.expandClusterEKSConfig(0xc0004796e0, 0x1, 0x1, 0xc000179770, 0x8, 0x70000c0006ffb80, 0xffffffffffffffff, 0x3)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/structure_cluster_eks_config.go:128 +0x8bd
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.expandCluster(0xc0001ec620, 0x28d5f70, 0xc0006ffa20, 0xc0006d7758)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/structure_cluster.go:232 +0x75a
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.resourceRancher2ClusterCreate(0xc0001ec620, 0x1d7d440, 0xc000345e60, 0x2, 0x29026c0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/resource_rancher2_cluster.go:34 +0x40
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema.(*Resource).Apply(0xc000426800, 0xc000530190, 0xc0003e5360, 0x1d7d440, 0xc000345e60, 0x1bde201, 0xc0006ff968, 0xc0006cc8d0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema/resource.go:286 +0x363
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema.(*Provider).Apply(0xc000427b80, 0xc0006d7a00, 0xc000530190, 0xc0003e5360, 0xc000ab6748, 0xc000b5ade0, 0x1be0820)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema/provider.go:285 +0x9c
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/plugin.(*GRPCProviderServer).ApplyResourceChange(0xc0000c2ac0, 0x1f595e0, 0xc000a90390, 0xc0000c5560, 0xc0000c2ac0, 0xc000a90300, 0x1c0c7e0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/plugin/grpc_provider.go:842 +0x87a
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/internal/tfplugin5._Provider_ApplyResourceChange_Handler(0x1d44ec0, 0xc0000c2ac0, 0x1f595e0, 0xc000a90390, 0xc0005309b0, 0x0, 0x0, 0x0, 0xc000536600, 0x5f0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/internal/tfplugin5/tfplugin5.pb.go:3019 +0x23e
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).processUnaryRPC(0xc000598c00, 0x1f62060, 0xc000599c80, 0xc00067b300, 0xc0001564b0, 0x28d63e0, 0x0, 0x0, 0x0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:966 +0x4a2
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).handleStream(0xc000598c00, 0x1f62060, 0xc000599c80, 0xc00067b300, 0x0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:1245 +0xd61
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).serveStreams.func1.1(0xc0000cc4e0, 0xc000598c00, 0x1f62060, 0xc000599c80, 0xc00067b300)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:685 +0x9f
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: created by github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).serveStreams.func1
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:683 +0xa1
2019-07-05T11:12:45.920+0200 [DEBUG] plugin: plugin process exited: path=/Users/shantanudeshpande/cloudssky_contrib/src/github.com/kubernauts/tk8-provisioner-cattle-eks/.terraform/plugins/darwin_amd64/terraform-provider-rancher2_v1.3.0_x4 pid=86149 error="exit status 2"
2019/07/05 11:12:45 [DEBUG] module.cattle-eks.rancher2_cluster.rancher-custom: apply errored, but we're indicating that via the Error pointer rather than returning it: rpc error: code = Unavailable desc = transport is closing
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalMaybeTainted
2019/07/05 11:12:45 [TRACE] EvalMaybeTainted: module.cattle-eks.rancher2_cluster.rancher-custom encountered an error during creation, so it is now marked as tainted
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalWriteState
2019/07/05 11:12:45 [TRACE] EvalWriteState: removing state object for module.cattle-eks.rancher2_cluster.rancher-custom
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalApplyProvisioners
2019/07/05 11:12:45 [TRACE] EvalApplyProvisioners: rancher2_cluster.rancher-custom has no state, so skipping provisioners
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalMaybeTainted
2019/07/05 11:12:45 [TRACE] EvalMaybeTainted: module.cattle-eks.rancher2_cluster.rancher-custom encountered an error during creation, so it is now marked as tainted
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalWriteState
2019/07/05 11:12:45 [TRACE] EvalWriteState: removing state object for module.cattle-eks.rancher2_cluster.rancher-custom
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalIf
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalIf
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalWriteDiff
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalApplyPost
2019/07/05 11:12:45 [ERROR] module.cattle-eks: eval: *terraform.EvalApplyPost, err: rpc error: code = Unavailable desc = transport is closing
2019/07/05 11:12:45 [ERROR] module.cattle-eks: eval: *terraform.EvalSequence, err: rpc error: code = Unavailable desc = transport is closing
2019/07/05 11:12:45 [TRACE] [walkApply] Exiting eval tree: module.cattle-eks.rancher2_cluster.rancher-custom
2019/07/05 11:12:45 [TRACE] vertex "module.cattle-eks.rancher2_cluster.rancher-custom": visit complete
2019/07/05 11:12:45 [TRACE] dag/walk: upstream of "module.cattle-eks.provider.rancher2 (close)" errored, so skipping
2019/07/05 11:12:45 [TRACE] dag/walk: upstream of "meta.count-boundary (EachMode fixup)" errored, so skipping
2019/07/05 11:12:45 [TRACE] dag/walk: upstream of "root" errored, so skipping
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: not making a backup, because the new snapshot is identical to the old
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: no state changes since last snapshot
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: writing snapshot at terraform.tfstate
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: removing lock metadata file .terraform.tfstate.lock.info
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: unlocking terraform.tfstate using fcntl flock
2019-07-05T11:12:45.930+0200 [DEBUG] plugin: plugin exited
panic: interface conversion: interface {} is nil, not string
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4:
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: goroutine 73 [running]:
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.toArrayString(0xc000479710, 0x1, 0x1, 0xf, 0xc0006cecb8, 0xa)
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/util.go:210 +0xfb
2019-07-05T11:12:45.917+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.expandClusterEKSConfig(0xc0004796e0, 0x1, 0x1, 0xc000179770, 0x8, 0x70000c0006ffb80, 0xffffffffffffffff, 0x3)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/structure_cluster_eks_config.go:128 +0x8bd
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.expandCluster(0xc0001ec620, 0x28d5f70, 0xc0006ffa20, 0xc0006d7758)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/structure_cluster.go:232 +0x75a
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/rancher2.resourceRancher2ClusterCreate(0xc0001ec620, 0x1d7d440, 0xc000345e60, 0x2, 0x29026c0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/rancher2/resource_rancher2_cluster.go:34 +0x40
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema.(*Resource).Apply(0xc000426800, 0xc000530190, 0xc0003e5360, 0x1d7d440, 0xc000345e60, 0x1bde201, 0xc0006ff968, 0xc0006cc8d0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema/resource.go:286 +0x363
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema.(*Provider).Apply(0xc000427b80, 0xc0006d7a00, 0xc000530190, 0xc0003e5360, 0xc000ab6748, 0xc000b5ade0, 0x1be0820)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/schema/provider.go:285 +0x9c
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/plugin.(*GRPCProviderServer).ApplyResourceChange(0xc0000c2ac0, 0x1f595e0, 0xc000a90390, 0xc0000c5560, 0xc0000c2ac0, 0xc000a90300, 0x1c0c7e0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/helper/plugin/grpc_provider.go:842 +0x87a
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/internal/tfplugin5._Provider_ApplyResourceChange_Handler(0x1d44ec0, 0xc0000c2ac0, 0x1f595e0, 0xc000a90390, 0xc0005309b0, 0x0, 0x0, 0x0, 0xc000536600, 0x5f0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/github.com/hashicorp/terraform/internal/tfplugin5/tfplugin5.pb.go:3019 +0x23e
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).processUnaryRPC(0xc000598c00, 0x1f62060, 0xc000599c80, 0xc00067b300, 0xc0001564b0, 0x28d63e0, 0x0, 0x0, 0x0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:966 +0x4a2
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).handleStream(0xc000598c00, 0x1f62060, 0xc000599c80, 0xc00067b300, 0x0)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:1245 +0xd61
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).serveStreams.func1.1(0xc0000cc4e0, 0xc000598c00, 0x1f62060, 0xc000599c80, 0xc00067b300)
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:685 +0x9f
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: created by github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc.(*Server).serveStreams.func1
2019-07-05T11:12:45.918+0200 [DEBUG] plugin.terraform-provider-rancher2_v1.3.0_x4: 	/opt/teamcity-agent/work/5d79fe75d4460a2f/src/github.com/terraform-providers/terraform-provider-rancher2/vendor/google.golang.org/grpc/server.go:683 +0xa1
2019-07-05T11:12:45.920+0200 [DEBUG] plugin: plugin process exited: path=/Users/shantanudeshpande/cloudssky_contrib/src/github.com/kubernauts/tk8-provisioner-cattle-eks/.terraform/plugins/darwin_amd64/terraform-provider-rancher2_v1.3.0_x4 pid=86149 error="exit status 2"
2019/07/05 11:12:45 [DEBUG] module.cattle-eks.rancher2_cluster.rancher-custom: apply errored, but we're indicating that via the Error pointer rather than returning it: rpc error: code = Unavailable desc = transport is closing
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalMaybeTainted
2019/07/05 11:12:45 [TRACE] EvalMaybeTainted: module.cattle-eks.rancher2_cluster.rancher-custom encountered an error during creation, so it is now marked as tainted
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalWriteState
2019/07/05 11:12:45 [TRACE] EvalWriteState: removing state object for module.cattle-eks.rancher2_cluster.rancher-custom
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalApplyProvisioners
2019/07/05 11:12:45 [TRACE] EvalApplyProvisioners: rancher2_cluster.rancher-custom has no state, so skipping provisioners
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalMaybeTainted
2019/07/05 11:12:45 [TRACE] EvalMaybeTainted: module.cattle-eks.rancher2_cluster.rancher-custom encountered an error during creation, so it is now marked as tainted
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalWriteState
2019/07/05 11:12:45 [TRACE] EvalWriteState: removing state object for module.cattle-eks.rancher2_cluster.rancher-custom
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalIf
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalIf
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalWriteDiff
2019/07/05 11:12:45 [TRACE] module.cattle-eks: eval: *terraform.EvalApplyPost
2019/07/05 11:12:45 [ERROR] module.cattle-eks: eval: *terraform.EvalApplyPost, err: rpc error: code = Unavailable desc = transport is closing
2019/07/05 11:12:45 [ERROR] module.cattle-eks: eval: *terraform.EvalSequence, err: rpc error: code = Unavailable desc = transport is closing
2019/07/05 11:12:45 [TRACE] [walkApply] Exiting eval tree: module.cattle-eks.rancher2_cluster.rancher-custom
2019/07/05 11:12:45 [TRACE] vertex "module.cattle-eks.rancher2_cluster.rancher-custom": visit complete
2019/07/05 11:12:45 [TRACE] dag/walk: upstream of "module.cattle-eks.provider.rancher2 (close)" errored, so skipping
2019/07/05 11:12:45 [TRACE] dag/walk: upstream of "meta.count-boundary (EachMode fixup)" errored, so skipping
2019/07/05 11:12:45 [TRACE] dag/walk: upstream of "root" errored, so skipping
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: not making a backup, because the new snapshot is identical to the old
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: no state changes since last snapshot
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: writing snapshot at terraform.tfstate
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: removing lock metadata file .terraform.tfstate.lock.info
2019/07/05 11:12:45 [TRACE] statemgr.Filesystem: unlocking terraform.tfstate using fcntl flock
2019-07-05T11:12:45.930+0200 [DEBUG] plugin: plugin exited



!!!!!!!!!!!!!!!!!!!!!!!!!!! TERRAFORM CRASH !!!!!!!!!!!!!!!!!!!!!!!!!!!!

Terraform crashed! This is always indicative of a bug within Terraform.
A crash log has been placed at "crash.log" relative to your current
working directory. It would be immensely helpful if you could please
report the crash with Terraform[1] so that we can fix this.

When reporting bugs, please include your terraform version. That
information is available on the first line of crash.log. You can also
get it by running 'terraform --version' on the command line.

[1]: https://github.com/hashicorp/terraform/issues

!!!!!!!!!!!!!!!!!!!!!!!!!!! TERRAFORM CRASH !!!!!!!!!!!!!!!!!!!!!!!!!!!!
```

I don't know why the logs say:
```
    The following problems may be the cause of any confusing errors from downstream operations:
      - .cluster_auth_endpoint: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
```

This is optional and gets computed automatically.

On a side note, I was not specifying `instance_type` previously. Now, I did but it's the same issue.

Updated `plan`:
```
  # module.cattle-eks.rancher2_cluster.rancher-custom will be created
  + resource "rancher2_cluster" "rancher-custom" {
      + annotations                             = (known after apply)
      + cluster_registration_token              = (known after apply)
      + default_pod_security_policy_template_id = (known after apply)
      + default_project_id                      = (known after apply)
      + description                             = "test-eks Kubernetes cluster"
      + driver                                  = (known after apply)
      + enable_network_policy                   = false
      + id                                      = (known after apply)
      + kube_config                             = (known after apply)
      + labels                                  = (known after apply)
      + name                                    = "test-eks"
      + system_project_id                       = (known after apply)

      + cluster_auth_endpoint {
          + ca_certs = (known after apply)
          + enabled  = (known after apply)
          + fqdn     = (known after apply)
        }

      + eks_config {
          + access_key                      = (sensitive value)
          + ami                             = "ami-0085d4f8878cddc81"
          + associate_worker_node_public_ip = true
          + instance_type                   = "t2.medium"
          + kubernetes_version              = "1.12"
          + maximum_nodes                   = 3
          + minimum_nodes                   = 1
          + node_volume_size                = 20
          + region                          = "eu-central-1"
          + secret_key                      = (sensitive value)
          + security_groups                 = [
              + "",
            ]
          + subnets                         = [
              + "",
            ]
          + user_data                       = (known after apply)
        }
    }
```